app/controllers/user_controller.rb

def login
@user = User.find_by(user_name: params[:user_name],
                      password: params[:password])
---
SELECT  "users".* FROM "users" WHERE "users"."user_name" = ? AND "users"."password" = ? LIMIT ?  [["user_name", "asas"], ["password", "asas"], ["LIMIT", 1]]